Revit 2027 API
IFCImportOptions.RevitLinkFileName Property
 The full path of the intermediate Revit file created during a previous link action. This is used during "Reload From" to determine the path to the previous generated Revit file.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RevitLinkFileName { get; set; }
Public Property RevitLinkFileName As String
	Get
	Set
public:
property String^ RevitLinkFileName {
	String^ get ();
	void set (String^ value);
}
member RevitLinkFileName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace